In [1]:
# groups the rows and aggregate the functions

In [2]:
import numpy as np
import pandas as pd

In [10]:
data={'Company':['Google','Google','MSFT','MSFT','FB','FB'],
      'Person':['Sam','Har','Cha','Roc','Brad','Tom'],
      'Sales':[200,300,400,500,600,100]}

In [11]:
df=pd.DataFrame(data)

In [12]:
df

  Company Person  Sales
0  Google    Sam    200
1  Google    Har    300
2    MSFT    Cha    400
3    MSFT    Roc    500
4      FB   Brad    600
5      FB    Tom    100

In [13]:
byComp=df.groupby('Company')

In [14]:
byComp.mean()

         Sales
Company
FB         350
Google     250
MSFT       450

In [15]:
byComp.sum()

         Sales
Company
FB         700
Google     500
MSFT       900

In [16]:
byComp.std()             #std is standard deviation

              Sales
Company
FB       353.553391
Google    70.710678
MSFT      70.710678

In [17]:
byComp.mean().loc['FB']

Sales    350
Name: FB, dtype: int64

In [18]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
FB        2.0  350.0  353.553391  100.0  225.0  350.0  475.0  600.0
Google    2.0  250.0   70.710678  200.0  225.0  250.0  275.0  300.0
MSFT      2.0  450.0   70.710678  400.0  425.0  450.0  475.0  500.0

In [19]:
df.groupby('Company').describe().transpose()

Company              FB      Google        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   350.000000  250.000000  450.000000
      std    353.553391   70.710678   70.710678
      min    100.000000  200.000000  400.000000
      25%    225.000000  225.000000  425.000000
      50%    350.000000  250.000000  450.000000
      75%    475.000000  275.000000  475.000000
      max    600.000000  300.000000  500.000000

In [20]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     350.000000
       std      353.553391
       min      100.000000
       25%      225.000000
       50%      350.000000
       75%      475.000000
       max      600.000000
Name: FB, dtype: float64